<script setup>
import PageDescription from "../components/PageDescription.vue";
</script>

<template>
  <PageDescription>
    Страница построена с использованием Vue.js. Используя современные технологии
    и подходы к разработке, я создаю интерактивные и удобные в использовании
    приложения. Допольнительные инструменты и технологии, которые я использую в
    этом проекте: <b>Vue Router</b> для управления маршрутизацией, а так же
    <b>Bootstrap</b> для стилизации и создания адаптивного дизайна.
  </PageDescription>

  <div class="row">
    <div class="col-6 mx-auto text-center">
      <p class="fs-4">
        Добро пожаловать на мой проект!
      </p>
      <p>Меня зовут Сергей, и я рад приветствовать вас здесь.</p>
      <p>
        На этой странице вы найдете информацию обо мне, моих увлечениях и
        проектах, которые я разработал в рамках учебного процесса. Я использовал
        Vue.js для создания интерактивных и динамичных интерфейсов, а также
        применял различные библиотеки и инструменты для улучшения
        функциональности и дизайна.
      </p>
      <p>
        На этой странице вы можете ознакомиться с моими проектами, такими как
        калькулятор, игра "Виселица", "Найди клад", "Игра в жизнь" и многое
        другое. Я стремился создать разнообразные приложения, чтобы
        продемонстрировать свои навыки и творческий подход к разработке.
      </p>
      <p>
        Я всегда открыт для новых знакомств и сотрудничества, поэтому не
        стесняйтесь связаться со мной, если у вас есть какие-либо вопросы или
        предложения.
      </p>
      <p>
        <a href="https://career.habr.com/lux-63">Я на Хабр карьере</a> 
      </p>
    </div>
    <div class="col-2">
      <img src="./personaPhoto.jpg" width="251" height="377" />
    </div>
  </div>
</template>
