<script setup></script>

<template>
  <div class="row">
    <div class="col-6 mx-auto text-center">
      <p class="fs-4">Добро пожаловать на мою страницу!</p>
      <p>Меня зовут Сергей, и я рад приветствовать вас здесь.</p>
      <p>
        На этой странице вы найдете информацию обо мне, моих увлечениях и
        проектах, над которыми я работаю. Я люблю программирование, путешествия
        и музыку. Здесь я делюсь своим опытом и достижениями.
      </p>
      <p>
        Спасибо, что посетили мою страницу, и я надеюсь, что вам будет интересно
        узнать обо мне больше!
      </p>
    </div>
    <div class="col-2">
      <img src="./personaPhoto.jpg" width="251" height="377" />
    </div>
  </div>
</template>
